Catalogs/Обучающиеся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Обучающиеся</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Документы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичноеДело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатПФДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеЛьготы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПереченьЛьгот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Основания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Категории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Родители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВладелецСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Родители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актуальный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдостоверениеМногодетных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУдостоверения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выдан</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Родители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актуальное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Родители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Родители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Родители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Документы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>Документы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПаспортГражданинаРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОРождении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Обучающиеся/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Массив) Экспорт

	ЗапросОбучающиеся = Новый Запрос("ВЫБРАТЬ
	                                 |	Обучающиеся.Наименование КАК ФИО,
	                                 |	Обучающиеся.ДатаРождения КАК ДатаРождения,
	                                 |	Обучающиеся.Документ КАК Документ,
	                                 |	Обучающиеся.ДокументСерия КАК ДокументСерия,
	                                 |	Обучающиеся.ДокументНомер КАК ДокументНомер,
	                                 |	Обучающиеся.ДокументВыдан КАК ДокументВыдан,
	                                 |	Обучающиеся.СНИЛС КАК СНИЛС,
	                                 |	Обучающиеся.Адрес КАК Адрес,
	                                 |	РодителиТабл.Родитель.Наименование КАК РодительФИО,
	                                 |	РодителиТабл.Родитель.ДатаРождения КАК РодительДатаРождения,
	                                 |	РодителиТабл.Родитель.ДокументСерия КАК РодительДокументСерия,
	                                 |	РодителиТабл.Родитель.ДокументНомер КАК РодительДокументНомер,
	                                 |	РодителиТабл.Родитель.ДокументВыдан КАК РодительДокументВыдан,
	                                 |	РодителиТабл.Родитель.ДокументДатаВыдачи КАК РодительДокументДатаВыдачи,
	                                 |	РодителиТабл.Родитель.СНИЛС КАК РодительСНИЛС,
	                                 |	РодителиТабл.Родитель.КонтактныйТелефон КАК РодительКонтактныйТелефон,
	                                 |	Обучающиеся.ДатаВыдачиДокумента КАК ДатаВыдачиДокумента,
	                                 |	РодителиТабл.Родитель.Ссылка КАК РодительСсылка
	                                 |ИЗ
	                                 |	Справочник.Обучающиеся.Родители КАК РодителиТабл
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся КАК Обучающиеся
	                                 |		ПО РодителиТабл.Ссылка = Обучающиеся.Ссылка
	                                 |ГДЕ
	                                 |	Обучающиеся.Ссылка В(&Массив)");
	ЗапросОбучающиеся.УстановитьПараметр("Массив",Массив);
	Обучающийся = ЗапросОбучающиеся.Выполнить().Выбрать();
	
	Макет = ПолучитьОбщийМакет("УведомлениеПДн");
	Область = Макет.ПолучитьОбласть("Область");
	
	
	Пока Обучающийся.Следующий() Цикл
		Область.Параметры.ФИООбучающегося = Обучающийся.ФИО;
		Область.Параметры.ДатаРожденияОбучающегося = Формат(Обучающийся.ДатаРождения, "ДФ=dd.MM.yyyy");
		Область.Параметры.ТипДокументаОбучающегося = Обучающийся.Документ;
		Область.Параметры.ДокСерияОбучающегося = Обучающийся.ДокументСерия;
		Область.Параметры.ДокНомерОбучающегося = Обучающийся.ДокументНомер;
		Область.Параметры.ДокВыданОбучающегося = Обучающийся.ДокументВыдан;
		Область.Параметры.ДокДатаВыдачиОбучающиегося = Формат(Обучающийся.ДатаВыдачиДокумента, "ДФ=dd.MM.yyyy");
		Область.Параметры.СНИЛСОбучающегося = Обучающийся.СНИЛС;
		Область.Параметры.АдресОбучающегося = Обучающийся.Адрес;
		Область.Параметры.ФИОРодителя = Обучающийся.РодительФИО;
		Область.Параметры.ДатаРожденияРодителя = Формат(Обучающийся.РодительДатаРождения, "ДФ=dd.MM.yyyy");
		Область.Параметры.ТипДокументаРодителя = Перечисления.Документы.ПаспортГражданинаРФ;
		Область.Параметры.ДокСерияРодителя = Обучающийся.РодительДокументСерия;
		Область.Параметры.ДокНомерРодителя = Обучающийся.РодительДокументНомер;
		Область.Параметры.ДокВыданРодителя = Обучающийся.РодительДокументВыдан;
		Область.Параметры.ДокДатаВыдачиРодителя = Формат(Обучающийся.РодительДокументДатаВыдачи, "ДФ=dd.MM.yyyy");
		Область.Параметры.СНИЛСРодителя = Обучающийся.РодительСНИЛС;
		Область.Параметры.ТелефонРодителя = Формат(Обучающийся.РодительКонтактныйТелефон,"ЧГ=0");
		Область.Параметры.ФИОРодителяКратко = ПолучитьИнициалы(Обучающийся.РодительСсылка);
		                                          
		
		ТабДок.Вывести(Область);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	 КонецЦикла; 
КонецПроцедуры
